import requests
from datetime import datetime, timedelta

region_coords = {
 '서울': {'nx': 60, 'ny': 127},
    '부산': {'nx': 98, 'ny': 76},
    '대구': {'nx': 89, 'ny': 90},
    '인천': {'nx': 55, 'ny': 124},
    '광주': {'nx': 58, 'ny': 74},
    '대전': {'nx': 67, 'ny': 100},
    '울산': {'nx': 102, 'ny': 84},
    '세종': {'nx': 66, 'ny': 103},
    '제주': {'nx': 52, 'ny': 38},
    '강릉': {'nx': 92, 'ny': 131},
    '춘천': {'nx': 73, 'ny': 134},
    '청주': {'nx': 69, 'ny': 106},
    '전주': {'nx': 63, 'ny': 89},
    '포항': {'nx': 102, 'ny': 94},
    '창원': {'nx': 91, 'ny': 77},
    '수원': {'nx': 60, 'ny': 121},
    '여수': {'nx': 73, 'ny': 66},
    '안동': {'nx': 91, 'ny': 106},
    '목포': {'nx': 50, 'ny': 67},
    '진주': {'nx': 81, 'ny': 75},
    '충주': {'nx': 76, 'ny': 114},
    '군산': {'nx': 56, 'ny': 92},
    '강화': {'nx': 51, 'ny': 130},
    '동두천': {'nx': 61, 'ny': 130},
    '속초': {'nx': 87, 'ny': 141},
    '양산': {'nx': 97, 'ny': 83},
    '경주': {'nx': 100, 'ny': 91},
    '김해': {'nx': 96, 'ny': 77},
    '남원': {'nx': 68, 'ny': 83},
    '영주': {'nx': 89, 'ny': 111},
    '보성': {'nx': 70, 'ny': 63},
    '사천': {'nx': 80, 'ny': 71},
    '속초': {'nx': 87, 'ny': 141},
    '순천': {'nx': 74, 'ny': 70},
    '영광': {'nx': 52, 'ny': 77},
    '영천': {'nx': 95, 'ny': 91},
    '완도': {'nx': 58, 'ny': 46},
    '익산': {'nx': 60, 'ny': 91},
    '정읍': {'nx': 58, 'ny': 81},
    '제천': {'nx': 81, 'ny': 118},
    '진안': {'nx': 66, 'ny': 86},
    '창녕': {'nx': 94, 'ny': 83},
    '태백': {'nx': 95, 'ny': 119},
    '통영': {'nx': 87, 'ny': 68},
    '파주': {'nx': 56, 'ny': 131},
    '하동': {'nx': 77, 'ny': 69},
    '홍성': {'nx': 57, 'ny': 102},
    '화순': {'nx': 62, 'ny': 66},
    '횡성': {'nx': 78, 'ny': 127}
}


# 사용자 입력 받음
city = input("지역 이름을 입력하세요")

if city in region_coords:
    print(f"{city}의 좌표: {region_coords[city]}")
else:
    print("입력하신 지역이 없습니다.")